; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain sailing)
     (:requirements :typing :fluents)
     (:types
          boat person - object
     )
     (:predicates
          (saved ?t - person)
     )
     (:functions
          (x ?b - boat)
          (y ?b - boat)
          (d ?t - person)
     )
     ;; Increment the value in the given counter by one
     (:action go_north_east
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_north_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 1.5) (increase (y ?b) 1.5))
     )
     (:action go_est
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 3))
     )
     (:action go_west
          :parameters (?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 3))
     )
     (:action go_south_west
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(increase (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south_east
          :parameters(?b - boat)
          :precondition (and)
          :effect (and(decrease (x ?b) 2) (decrease (y ?b) 2))
     )
     (:action go_south
          :parameters(?b - boat)
          :precondition (and)
          :effect (and (decrease (y ?b) 2))
     )
     (:action save_person
          :parameters(?b - boat ?t - person)
          :precondition ( and (>= (+ (x ?b) (y ?b)) (d ?t))
               (>= (- (y ?b) (x ?b)) (d ?t))
               (<= (+ (x ?b) (y ?b)) (+ (d ?t) 25))
               (<= (- (y ?b) (x ?b)) (+ (d ?t) 25))
          )
          :effect (and(saved ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_14_16)

	(:domain sailing)

	(:objects
		b0 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 - boat
		p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 - person
	)

  (:init
		(= (x b0) -5)
(= (y b0) 0)
(= (x b1) 0)
(= (y b1) 0)
(= (x b2) 10)
(= (y b2) 0)
(= (x b3) -6)
(= (y b3) 0)
(= (x b4) 2)
(= (y b4) 0)
(= (x b5) -3)
(= (y b5) 0)
(= (x b6) 2)
(= (y b6) 0)
(= (x b7) 10)
(= (y b7) 0)
(= (x b8) 2)
(= (y b8) 0)
(= (x b9) 4)
(= (y b9) 0)
(= (x b10) -6)
(= (y b10) 0)
(= (x b11) 3)
(= (y b11) 0)
(= (x b12) 4)
(= (y b12) 0)
(= (x b13) 1)
(= (y b13) 0)

		(= (d p0) 34)
(= (d p1) 70)
(= (d p2) 49)
(= (d p3) 69)
(= (d p4) 62)
(= (d p5) 18)
(= (d p6) 90)
(= (d p7) 30)
(= (d p8) 50)
(= (d p9) 97)
(= (d p10) 40)
(= (d p11) 80)
(= (d p12) 15)
(= (d p13) 64)
(= (d p14) 22)
(= (d p15) 85)

	)

	(:goal
		(and
			(saved p0)
(saved p1)
(saved p2)
(saved p3)
(saved p4)
(saved p5)
(saved p6)
(saved p7)
(saved p8)
(saved p9)
(saved p10)
(saved p11)
(saved p12)
(saved p13)
(saved p14)
(saved p15)
		)
	)
)

; plan
1. (go_north_east b1)
   changed: (x b1) from 0 to 1.5, (y b1) from 0 to 1.5
   goals met: 0 of 16
2. (go_north_east b1)
   changed: (x b1) from 1.5 to 3, (y b1) from 1.5 to 3
   goals met: 0 of 16
3. (go_north_east b1)
   changed: (x b1) from 3 to 4.5, (y b1) from 3 to 4.5
   goals met: 0 of 16
4. (go_north_east b1)
   changed: (x b1) from 4.5 to 6, (y b1) from 4.5 to 6
   goals met: 0 of 16
5. (go_north_east b1)
   changed: (x b1) from 6 to 7.5, (y b1) from 6 to 7.5
   goals met: 0 of 16
6. (go_north_east b1)
   changed: (x b1) from 7.5 to 9, (y b1) from 7.5 to 9
   goals met: 0 of 16
7. (go_north_east b1)
   changed: (x b1) from 9 to 10.5, (y b1) from 9 to 10.5
   goals met: 0 of 16
8. (go_north_east b1)
   changed: (x b1) from 10.5 to 12, (y b1) from 10.5 to 12
   goals met: 0 of 16
9. (go_north_east b1)
   changed: (x b1) from 12 to 13.5, (y b1) from 12 to 13.5
   goals met: 0 of 16
10. (go_north_east b1)
   changed: (x b1) from 13.5 to 15, (y b1) from 13.5 to 15
   goals met: 0 of 16
11. (go_north_east b1)
   changed: (x b1) from 15 to 16.5, (y b1) from 15 to 16.5
   goals met: 0 of 16
12. (go_north_east b1)
   changed: (x b1) from 16.5 to 18, (y b1) from 16.5 to 18
   goals met: 0 of 16
13. (go_north_west b1)
   changed: (x b1) from 18 to 16.5, (y b1) from 18 to 19.5
   goals met: 0 of 16
14. (go_north_west b1)
   changed: (x b1) from 16.5 to 15, (y b1) from 19.5 to 21
   goals met: 0 of 16
15. (go_north_west b1)
   changed: (x b1) from 15 to 13.5, (y b1) from 21 to 22.5
   goals met: 0 of 16
16. (go_north_west b1)
   changed: (x b1) from 13.5 to 12, (y b1) from 22.5 to 24
   goals met: 0 of 16
17. (go_north_west b1)
   changed: (x b1) from 12 to 10.5, (y b1) from 24 to 25.5
   goals met: 0 of 16
18. (save_person b1 p12)
   added: (saved p12)
   goals met: 1 of 16
19. (go_north_east b1)
   changed: (x b1) from 10.5 to 12, (y b1) from 25.5 to 27
   goals met: 1 of 16
20. (go_north_east b1)
   changed: (x b1) from 12 to 13.5, (y b1) from 27 to 28.5
   goals met: 1 of 16
21. (go_north_west b1)
   changed: (x b1) from 13.5 to 12, (y b1) from 28.5 to 30
   goals met: 1 of 16
22. (save_person b1 p5)
   added: (saved p5)
   goals met: 2 of 16
23. (go_north_east b1)
   changed: (x b1) from 12 to 13.5, (y b1) from 30 to 31.5
   goals met: 2 of 16
24. (go_north_east b1)
   changed: (x b1) from 13.5 to 15, (y b1) from 31.5 to 33
   goals met: 2 of 16
25. (go_north_east b1)
   changed: (x b1) from 15 to 16.5, (y b1) from 33 to 34.5
   goals met: 2 of 16
26. (go_north_west b1)
   changed: (x b1) from 16.5 to 15, (y b1) from 34.5 to 36
   goals met: 2 of 16
27. (go_north_west b1)
   changed: (x b1) from 15 to 13.5, (y b1) from 36 to 37.5
   goals met: 2 of 16
28. (go_north_west b1)
   changed: (x b1) from 13.5 to 12, (y b1) from 37.5 to 39
   goals met: 2 of 16
29. (go_north_west b1)
   changed: (x b1) from 12 to 10.5, (y b1) from 39 to 40.5
   goals met: 2 of 16
30. (save_person b1 p7)
   added: (saved p7)
   goals met: 3 of 16
31. (go_north_west b1)
   changed: (x b1) from 10.5 to 9, (y b1) from 40.5 to 42
   goals met: 3 of 16
32. (go_north_west b1)
   changed: (x b1) from 9 to 7.5, (y b1) from 42 to 43.5
   goals met: 3 of 16
33. (save_person b1 p0)
   added: (saved p0)
   goals met: 4 of 16
34. (go_north_west b1)
   changed: (x b1) from 7.5 to 6, (y b1) from 43.5 to 45
   goals met: 4 of 16
35. (go_north_west b1)
   changed: (x b1) from 6 to 4.5, (y b1) from 45 to 46.5
   goals met: 4 of 16
36. (save_person b1 p10)
   added: (saved p10)
   goals met: 5 of 16
37. (go_north_west b1)
   changed: (x b1) from 4.5 to 3, (y b1) from 46.5 to 48
   goals met: 5 of 16
38. (go_north_east b1)
   changed: (x b1) from 3 to 4.5, (y b1) from 48 to 49.5
   goals met: 5 of 16
39. (go_north_east b1)
   changed: (x b1) from 4.5 to 6, (y b1) from 49.5 to 51
   goals met: 5 of 16
40. (go_north_east b1)
   changed: (x b1) from 6 to 7.5, (y b1) from 51 to 52.5
   goals met: 5 of 16
41. (go_north_east b1)
   changed: (x b1) from 7.5 to 9, (y b1) from 52.5 to 54
   goals met: 5 of 16
42. (go_north_west b1)
   changed: (x b1) from 9 to 7.5, (y b1) from 54 to 55.5
   goals met: 5 of 16
43. (go_north_west b1)
   changed: (x b1) from 7.5 to 6, (y b1) from 55.5 to 57
   goals met: 5 of 16
44. (save_person b1 p2)
   added: (saved p2)
   goals met: 6 of 16
45. (save_person b1 p8)
   added: (saved p8)
   goals met: 7 of 16
46. (go_west b1)
   changed: (x b1) from 6 to 3
   goals met: 7 of 16
47. (go_west b1)
   changed: (x b1) from 3 to 0
   goals met: 7 of 16
48. (go_west b1)
   changed: (x b1) from 0 to -3
   goals met: 7 of 16
49. (go_west b1)
   changed: (x b1) from -3 to -6
   goals met: 7 of 16
50. (go_north_east b1)
   changed: (x b1) from -6 to -4.5, (y b1) from 57 to 58.5
   goals met: 7 of 16
51. (go_north_east b1)
   changed: (x b1) from -4.5 to -3, (y b1) from 58.5 to 60
   goals met: 7 of 16
52. (go_north_east b1)
   changed: (x b1) from -3 to -1.5, (y b1) from 60 to 61.5
   goals met: 7 of 16
53. (go_north_east b1)
   changed: (x b1) from -1.5 to 0, (y b1) from 61.5 to 63
   goals met: 7 of 16
54. (save_person b1 p4)
   added: (saved p4)
   goals met: 8 of 16
55. (go_south_east b1)
   changed: (x b1) from 0 to -2, (y b1) from 63 to 61
   goals met: 8 of 16
56. (go_north_east b1)
   changed: (x b1) from -2 to -0.5, (y b1) from 61 to 62.5
   goals met: 8 of 16
57. (go_north_east b1)
   changed: (x b1) from -0.5 to 1, (y b1) from 62.5 to 64
   goals met: 8 of 16
58. (go_north_east b1)
   changed: (x b1) from 1 to 2.5, (y b1) from 64 to 65.5
   goals met: 8 of 16
59. (go_north_east b1)
   changed: (x b1) from 2.5 to 4, (y b1) from 65.5 to 67
   goals met: 8 of 16
60. (go_north_west b1)
   changed: (x b1) from 4 to 2.5, (y b1) from 67 to 68.5
   goals met: 8 of 16
61. (save_person b1 p13)
   added: (saved p13)
   goals met: 9 of 16
62. (go_north_west b1)
   changed: (x b1) from 2.5 to 1, (y b1) from 68.5 to 70
   goals met: 9 of 16
63. (save_person b1 p3)
   added: (saved p3)
   goals met: 10 of 16
64. (go_north_west b1)
   changed: (x b1) from 1 to -0.5, (y b1) from 70 to 71.5
   goals met: 10 of 16
65. (save_person b1 p1)
   added: (saved p1)
   goals met: 11 of 16
66. (go_north_west b1)
   changed: (x b1) from -0.5 to -2, (y b1) from 71.5 to 73
   goals met: 11 of 16
67. (go_north_east b1)
   changed: (x b1) from -2 to -0.5, (y b1) from 73 to 74.5
   goals met: 11 of 16
68. (go_north_east b1)
   changed: (x b1) from -0.5 to 1, (y b1) from 74.5 to 76
   goals met: 11 of 16
69. (go_north_east b1)
   changed: (x b1) from 1 to 2.5, (y b1) from 76 to 77.5
   goals met: 11 of 16
70. (go_north_east b13)
   changed: (x b13) from 1 to 2.5, (y b13) from 0 to 1.5
   goals met: 11 of 16
71. (go_north_east b13)
   changed: (x b13) from 2.5 to 4, (y b13) from 1.5 to 3
   goals met: 11 of 16
72. (go_north_east b13)
   changed: (x b13) from 4 to 5.5, (y b13) from 3 to 4.5
   goals met: 11 of 16
73. (go_north_east b13)
   changed: (x b13) from 5.5 to 7, (y b13) from 4.5 to 6
   goals met: 11 of 16
74. (go_north_east b13)
   changed: (x b13) from 7 to 8.5, (y b13) from 6 to 7.5
   goals met: 11 of 16
75. (go_north_east b13)
   changed: (x b13) from 8.5 to 10, (y b13) from 7.5 to 9
   goals met: 11 of 16
76. (go_north_east b13)
   changed: (x b13) from 10 to 11.5, (y b13) from 9 to 10.5
   goals met: 11 of 16
77. (go_north_east b1)
   changed: (x b1) from 2.5 to 4, (y b1) from 77.5 to 79
   goals met: 11 of 16
78. (go_north_east b1)
   changed: (x b1) from 4 to 5.5, (y b1) from 79 to 80.5
   goals met: 11 of 16
79. (go_north_east b1)
   changed: (x b1) from 5.5 to 7, (y b1) from 80.5 to 82
   goals met: 11 of 16
80. (go_north_east b1)
   changed: (x b1) from 7 to 8.5, (y b1) from 82 to 83.5
   goals met: 11 of 16
81. (go_north_east b1)
   changed: (x b1) from 8.5 to 10, (y b1) from 83.5 to 85
   goals met: 11 of 16
82. (go_north_east b1)
   changed: (x b1) from 10 to 11.5, (y b1) from 85 to 86.5
   goals met: 11 of 16
83. (go_north_west b1)
   changed: (x b1) from 11.5 to 10, (y b1) from 86.5 to 88
   goals met: 11 of 16
84. (go_north_west b1)
   changed: (x b1) from 10 to 8.5, (y b1) from 88 to 89.5
   goals met: 11 of 16
85. (save_person b1 p11)
   added: (saved p11)
   goals met: 12 of 16
86. (go_north_west b1)
   changed: (x b1) from 8.5 to 7, (y b1) from 89.5 to 91
   goals met: 12 of 16
87. (go_north_west b1)
   changed: (x b1) from 7 to 5.5, (y b1) from 91 to 92.5
   goals met: 12 of 16
88. (save_person b1 p15)
   added: (saved p15)
   goals met: 13 of 16
89. (go_north_west b1)
   changed: (x b1) from 5.5 to 4, (y b1) from 92.5 to 94
   goals met: 13 of 16
90. (save_person b1 p6)
   added: (saved p6)
   goals met: 14 of 16
91. (go_north_west b1)
   changed: (x b1) from 4 to 2.5, (y b1) from 94 to 95.5
   goals met: 14 of 16
92. (go_north_west b1)
   changed: (x b1) from 2.5 to 1, (y b1) from 95.5 to 97
   goals met: 14 of 16
93. (go_north_west b1)
   changed: (x b1) from 1 to -0.5, (y b1) from 97 to 98.5
   goals met: 14 of 16
94. (save_person b1 p9)
   added: (saved p9)
   goals met: 15 of 16
95. (go_north_west b13)
   changed: (x b13) from 11.5 to 10, (y b13) from 10.5 to 12
   goals met: 15 of 16
96. (go_north_west b13)
   changed: (x b13) from 10 to 8.5, (y b13) from 12 to 13.5
   goals met: 15 of 16
97. (go_north_west b13)
   changed: (x b13) from 8.5 to 7, (y b13) from 13.5 to 15
   goals met: 15 of 16
98. (go_north_west b13)
   changed: (x b13) from 7 to 5.5, (y b13) from 15 to 16.5
   goals met: 15 of 16
99. (go_north_west b13)
   changed: (x b13) from 5.5 to 4, (y b13) from 16.5 to 18
   goals met: 15 of 16
100. (go_north_west b13)
   changed: (x b13) from 4 to 2.5, (y b13) from 18 to 19.5
   goals met: 15 of 16
101. (go_north_west b13)
   changed: (x b13) from 2.5 to 1, (y b13) from 19.5 to 21
   goals met: 15 of 16
102. (go_north_west b13)
   changed: (x b13) from 1 to -0.5, (y b13) from 21 to 22.5
   goals met: 15 of 16
103. (save_person b13 p14)
   added: (saved p14)
   goals met: 16 of 16
